{"config": [{"config": {"nb_filter": 32, "W_constraint": null, "input_dtype": "float32", "batch_input_shape": [null, 22, 9, 3], "dim_ordering": "tf", "nb_col": 3, "bias": true, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 3, "border_mode": "same", "name": "convolution2d_1", "b_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_filter": 32, "W_constraint": null, "bias": true, "dim_ordering": "tf", "nb_col": 3, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "nb_row": 3, "border_mode": "valid", "name": "convolution2d_2", "b_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 64, "W_constraint": null, "bias": true, "dim_ordering": "tf", "nb_col": 3, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "nb_row": 3, "border_mode": "same", "name": "convolution2d_3", "b_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_filter": 64, "W_constraint": null, "bias": true, "dim_ordering": "tf", "nb_col": 3, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "nb_row": 3, "border_mode": "valid", "name": "convolution2d_4", "b_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 1], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 1]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.25, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "input_dim": null, "bias": true, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 512, "b_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "input_dim": null, "bias": true, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 10, "b_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "keras_version": "1.1.0", "class_name": "Sequential"}